/*===============================================================================================
==                                                                                              
**  Copyright(c) 2015  ZhenYao Science and technology co., LTD.   All rights reserved.
==                                                                                           
**	Author:		Asen                                                                           
==                                                                                          
**  Version:	v1.0.0                                                                          
==
**  Filename:	App_SZZDL.h                                                                       
==                                                                                         
**  Function:	深圳智动力精密技术股份有限公司 指纹寄存柜应用程序                                                               
==
**  Data:       2015-12-05
================================================================================================*/

#ifndef _ZW2016_H_
#define _ZW2016_H_


/***********************************************************************************************
* Function Name  : FingerprintLockers_Init
* Description	 : 指纹随机存储柜初始化
* Input 		 : None
* Output		 : None
* Return		 : None 
* Notes          : 所有变量的初始化
***********************************************************************************************/
extern void  FingerprintLockers_Init(void);

/***********************************************************************************************
* Function Name  : JiCunKey_Login
* Description	 : 按下寄存键后的操作
* Input 		 : None
* Output		 : None
* Return		 : None 
* Notes          : None
***********************************************************************************************/
extern void  JiCunKey_Login(void);


/***********************************************************************************************
* Function Name  : Lockers_OpenBox
* Description	 : 指纹存储柜开箱操作
* Input 		 : None
* Output		 : None
* Return		 : None 
* Notes          : 0.系统空闲时才读卡--检查系统卡
***********************************************************************************************/
extern void  Lockers_OpenBox(void);

#endif //_ZW2016_H_


/*===================================File end===================================================*/

